<?php


$is_auth = (bool)rand(0, 1);

$user_name = 'Константин';
$user_avatar = 'img/user.jpg';


//$title = 'Главная';
$category = [
  [
    'classCat' => 'promo__item--boards',
    'category' => 'Доски и лыжи'

  ],
  [
    'classCat' => 'promo__item--attachment',
    'category' => 'Крепления'
  ],
  [
    'classCat' => 'promo__item--boots',
    'category' => 'Ботинки'
  ],
  [
    'classCat' => 'promo__item--clothing',
    'category' => 'Одежда'
  ],
  [
    'classCat' => 'promo__item--tools',
    'category' => 'Инструменты'
  ],
  [
    'classCat' => 'promo__item--other',
    'category' => 'Разное'
  ],
];

$array_lots = [
  [
    'name' => '2014 Rossignol District Snowboard',
    'category' => 'Доски и лыжи',
    'price' => '10999',
    'url_img' => 'img/lot-1.jpg',
    'description' => 'Легкий маневренный сноуборд, готовый дать жару в любом парке, растопив снег мощным щелчком и четкими дугами. Стекловолокно Bi-Ax, уложенное в двух направлениях, наделяет этот снаряд отличной гибкостью и отзывчивостью, а симметричная геометрия в сочетании с классическим прогибом кэмбер позволит уверенно держать высокие скорости. А если к концу катального дня сил совсем не останется, просто посмотрите на Вашу доску и улыбнитесь, крутая графика от Шона Кливера еще никого не оставляла равнодушным.'
  ],
  [
    'name' => 'DC Ply Mens 2016/2017 Snowboard',
    'category' => 'Доски и лыжи',
    'price' => '159999',
    'url_img' => 'img/lot-2.jpg',
    'description' => 'Сноуборд представляет собой многослойную конструкцию (в форме доски с загнутыми торцами, со среднестатистической длиной 140—165 см и шириной примерно с длину ступни райдера) с металлическим кантом по периметру нижней части и креплениями (обычно продаются отдельно) для ног.'
  ],
  [
    'name' => 'Крепления Union Contact Pro 2015 года размер L/XL',
    'category' => 'Крепления',
    'price' => '8000',
    'url_img' => 'img/lot-3.jpg',
    'description' => 'Крепления Meteorite разработаны для райдеров, которым нужны стабильные и удобные крепления со средней комфортной гибкостью и хорошей отзывчивостью. Они обеспечивают точную отдачу благодаря технологии Skate-Tech, которая передает вашу энергию прямо на кант. Хайбэк Dynamic Flex у Meteorite жесткий в центре, для прочной поддержки и более мягкий по бокам, для удобной маневренности. Эти крепления можно настроить в режим серфинга или фрирайда, поменяв бушинги и сменив местами верхние стрепы Flip-It. Режим серфинга предлагает максимальные возможности настройки, режим фрирайда - максимальную отдачу. Чтобы ваши ботинки были зафиксированы, не повреждая стреп, Meteorite оснащены прошитыми ремешками Flip-It Mid-Wide, которые имеют монолитную 3D-сердцевину для прочной поддержки и синтетическую пену для равномерного распределения давления и боковой гибкости.'
  ],
  [
    'name' => 'Ботинки для сноуборда DC Mutiny Charocal',
    'category' => 'Ботинки',
    'price' => '10999',
    'url_img' => 'img/lot-4.jpg',
    'description' => 'Абсолютный фаворит среди женских ботинок от Burton, модель Mint завоевала популярность уже много лет назад, и удерживает ее до сих пор. Неудивительно, ведь перед нами сбалансированный и удобный ботинок для начинающих и продолжающих сноубордисток, идеально сочетающий комфорт и технологичность. Дизайн True Fit, созданный специально для женщин с учетом особенностей катания и размера ноги, подошва Dynolite, которая дает большую площадь соприкосновения с доской, вставка из теплоотражающего материала для сохранения тепла ног, удобный внутренник Imprint 1+ и конечно же быстрая двухзонная шнуровка Speed Zone™, обеспечивающая равномерную утяжку с удобной настройкой силы натяжения верхней и нижней части ботинка по отдельности. А еще привлекательные расцветки, ведь что бы ни говорили, для девушек это по-настоящему важно!'
  ],
  [
    'name' => 'Куртка для сноуборда DC Mutiny Charocal',
    'category' => 'Одежда',
    'price' => '7500',
    'url_img' => 'img/lot-5.jpg',
    'description' => 'Куртка Roxy Jet Ski Snow Jacket - яркая модель для девочки, выполненная с учетом необходимого функционала для комфортного горнолыжного и сноубордического катания. Модель с мембраной и синтетическим утеплителем Warmflight® обеспечит отличную защиту от непогоды и комфорт во время пребывания на склоне. Множество продуманных элементов помогут сконцентрироваться на катании и получать максимум удовольствия. '
  ],
  [
    'name' => 'Маска Oakley Canopy',
    'category' => 'Разное',
    'price' => '5400',
    'url_img' => 'img/lot-6.jpg',
    'description' => 'Горнолыжная маска G 500 S3 обеспеч. хор. видимость в ясную и пасм. погоду благ. двойной линзе с антизапот. покрытием, которое задерживает образование испарины.Совместимость с очками д/коррекции зрения'
  ],
];